1) Как организовать клиент-серверное взаимодействие?
Создаем отдельно клиент и отдельно сервер. Далее сервер слушает порт и ждет подключение клиентов(в бесконечном цикле).
на стороне клиента создаем сокет и делаем подключение к северу(делается разовый запрос без цикла),
работу с сокетами делаем в отдельном потоке.

2) Как и в каком виде передавать файлы?
Клиент преобразует файл в байты, отправляет его на сервер, а затем сервер преобразует байты обратно в файл.

3) Как пересылать большие файлы?
Преобразовывать в байты блоками, и отправлятьв буфер или же напрямую.

4) Как пересылать служебные команды?
Заранее определить типы команд.

5) Что хранить в базе данных?
В БД надо хранить информацию о пользователе(логин, пароль и т.д.), в случае если мы создаем для каждого пользователя
отдельную деррикторию. Иначе надо хранить информацию о загруженных файлах.

6) Как передавать структуру каталогов/файлов?
Исходя от выбранного протокола передачи данных:
можно сделать загрузку файлов служебной командой и передовать путь к файлу.

7) Какую библиотеку использовать для сетевого взаимодействия: java.io, java.nio, Netty?
 В зависимости от поставленной цели, если у нас не большое кол-во соединений,
 по которым передаются большие объемы данных то лучше выбрать java.io.
 Если же у нас большое кол-во соединений то лучше использвать java.nio, Netty(Java NIO.2).